# IsMaterialSimple

```pascal
FUNCTION IsMaterialSimple(materialHandle : HANDLE): BOOLEAN;
```

```python
def vs.IsMaterialSimple(materialHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|materialHandle|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes